In [1]:
getwd()

[1] "D:/1. HaiAnh/Cung cap du lieu buoi 4"

In [2]:
# Set current worjing directory
#setwd()

In [3]:
content <- readLines('Du_lieu/license.txt')
print(content)

[1] "These data files are derived by splitting up the data set downloaded from:"
[2] "https://www.ontario.ca/data/ontario-public-schools-enrolment"
[3] "under the Open Government License - Ontario:"
[4] "https://www.ontario.ca/page/open-government-licence-ontario"

In [6]:
content <- readLines('Du_lieu/bai_tho.txt', encoding='UTF-8')
print(content)

[1] "<U+FEFF>Mùa xuân là T<U+1EBF>t tr<U+1ED3>ng cây"
[2] "Làm cho d<U+1EA5>t nu<U+1EDB>c càng ngày càng xuân"
[3] ""

In [7]:
content

[1] "<U+FEFF>Mùa xuân là T<U+1EBF>t tr<U+1ED3>ng cây"
[2] "Làm cho d<U+1EA5>t nu<U+1EDB>c càng ngày càng xuân"
[3] ""

In [8]:
print(length(content))

[1] 3

In [9]:
print(nchar(content))

[1] 26 36  0

In [12]:
print(paste(file.size('Du_lieu/license.txt'),'bytes'))

[1] "242 bytes"

In [15]:
content1 <- scan('Du_lieu/license.txt',"")
print(content1)

 [1] "These"
 [2] "data"
 [3] "files"
 [4] "are"
 [5] "derived"
 [6] "by"
 [7] "splitting"
 [8] "up"
 [9] "the"
[10] "data"
[11] "set"
[12] "downloaded"
[13] "from:"
[14] "https://www.ontario.ca/data/ontario-public-schools-enrolment"
[15] "under"
[16] "the"
[17] "Open"
[18] "Government"
[19] "License"
[20] "-"
[21] "Ontario:"
[22] "https://www.ontario.ca/page/open-government-licence-ontario"

In [16]:
df <- read.table('Du_lieu/Table0.txt')

In [17]:
print(df)

        V1 V2  V3 V4 V5
1     Alex 25 177 57  F
2    Lilly 31 163 69  F
3     Mark 23 190 83  M
4   Oliver 52 179 75  M
5   Martha 76 163 70  F
6    Lucas 49 183 83  M
7 Caroline 26 164 53  F

In [18]:
col_names <- c('Name','Age','Height','Weight','Gender')

In [19]:
names(df) <- col_names

In [20]:
df

  Name     Age Height Weight Gender
1 Alex     25  177    57     F
2 Lilly    31  163    69     F
3 Mark     23  190    83     M
4 Oliver   52  179    75     M
5 Martha   76  163    70     F
6 Lucas    49  183    83     M
7 Caroline 26  164    53     F

# Write

In [21]:
content2 <- 'Hello and welcome'

In [22]:
file_name <- file(description='text.txt','a',encoding='UTF-8')

In [23]:
write(content2,file=file_name)

In [24]:
write.table(df, file='Table_new.txt',sep='\t')

# csv

In [25]:
data <- read.csv('Du_lieu/emp.csv')

In [26]:
print(data)

  id     name salary start_date       dept
1  1     Rick 623.30 2012-01-01         IT
2  2      Dan 515.20 2013-09-23 Operations
3  3 Michelle 611.00 2014-11-15         IT
4  4     Ryan 729.00 2014-05-11         HR
5 NA     Gary 843.25 2015-03-27    Finance
6  6     Nina 578.00 2013-05-21         IT
7  7    Simon 632.80 2013-07-30 Operations
8  8     Guru 722.50 2014-06-17    Finance

In [27]:
print(is.data.frame(data))

[1] TRUE

In [28]:
print(ncol(data))

[1] 5

In [30]:
print(nrow(data))

[1] 8

In [31]:
print(paste('Max salary: ', max(data$salary)))

[1] "Max salary:  843.25"

In [32]:
print(subset(data, salary==max(data$salary)))

  id name salary start_date    dept
5 NA Gary 843.25 2015-03-27 Finance

In [35]:
data[data['salary']==max(data$salary),]

  id name salary start_date dept
5 NA Gary 843.25 2015-03-27 Finance

In [34]:
library('tidyverse')

-- Attaching packages --------------------------------------- tidyverse 1.3.0 --

v ggplot2 3.3.2     v purrr   0.3.4
v tibble  3.0.3     v dplyr   1.0.2
v tidyr   1.1.1     v stringr 1.4.0
v readr   1.3.1     v forcats 0.5.0

-- Conflicts ------------------------------------------ tidyverse_conflicts() --
x dplyr::filter() masks stats::filter()
x dplyr::lag()    masks stats::lag()

In [40]:
filter(data, salary==max(data$salary))

  id name salary start_date dept
1 NA Gary 843.25 2015-03-27 Finance

In [41]:
retval <- subset(data, dept=='IT')

In [42]:
print(retval)

  id     name salary start_date dept
1  1     Rick  623.3 2012-01-01   IT
3  3 Michelle  611.0 2014-11-15   IT
6  6     Nina  578.0 2013-05-21   IT

In [43]:
info <- subset(data,salary>600 & dept=='IT')

In [44]:
print(info)

  id     name salary start_date dept
1  1     Rick  623.3 2012-01-01   IT
3  3 Michelle  611.0 2014-11-15   IT

In [45]:
retval <- subset(data, as.Date(start_date) > as.Date("2014-01-01"))

In [46]:
print(retval)

  id     name salary start_date    dept
3  3 Michelle 611.00 2014-11-15      IT
4  4     Ryan 729.00 2014-05-11      HR
5 NA     Gary 843.25 2015-03-27 Finance
8  8     Guru 722.50 2014-06-17 Finance

In [47]:
it_empt <- subset(data, dept=='IT')

In [48]:
write.csv(it_empt,'it_empt.csv',row.names=FALSE)

In [49]:
new_data <- read.csv('it_empt.csv')
print(new_data)

  id     name salary start_date dept
1  1     Rick  623.3 2012-01-01   IT
2  3 Michelle  611.0 2014-11-15   IT
3  6     Nina  578.0 2013-05-21   IT

# Excel

In [50]:
library('xlsx')

In [51]:
data <- read.xlsx('Du_lieu/emp_data.xlsx', sheetIndex=1)

In [52]:
print(data)

  id     name salary start_date       dept
1  1     Rick 623.30 2012-01-01         IT
2  2      Dan 515.20 2013-09-23 Operations
3  3 Michelle 611.00 2014-11-15         IT
4  4     Ryan 729.00 2014-05-11         HR
5        Gary 843.25 2015-03-27    Finance
6  6     Nina 578.00 2013-05-21         IT
7  7    Simon 632.80 2013-07-30 Operations
8  8     Guru 722.50 2014-06-17    Finance

In [53]:
data <- read.xlsx('Du_lieu/emp_data.xlsx', sheetName='city')
print(data)

      name    city
1     Rick Seattle
2      Dan   Tampa
3 Michelle Chicago
4     Ryan Seattle
5     Gary Houston
6     Nina  Boston
7    Simon  Mumbai
8     Guru  Dallas

In [58]:
write.xlsx(retval,file='emp_data.xlsx', sheetName='Sheet1', append=FALSE)

In [59]:
newdata <- read.xlsx('emp_data.xlsx', sheetName='Sheet1')

In [60]:
print(newdata)

  NA. id     name salary start_date    dept
1   3  3 Michelle 611.00 2014-11-15      IT
2   4  4     Ryan 729.00 2014-05-11      HR
3   5 NA     Gary 843.25 2015-03-27 Finance
4   8  8     Guru 722.50 2014-06-17 Finance